---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.CanExecuteEventArgs
source: html/5134d351-8835-2e5f-8133-6e6e91b2e232.htm
---
# CanExecuteEventArgs Methods

Gets the category ids of selected elements.